<template>
  <div class="container">
    <div class="content">
      <div class="left">
        <el-card class="blog" v-for="i in 5" shadow="never">
          <el-row>
            <el-col :span="6">
              <el-image class="cover" fit="fill" src="https://china-qixiao.oss-cn-beijing.aliyuncs.com/qixiao-blog/ad/5.jpg" alt=""/>
            </el-col>
            <el-col :span="18">
              <div class="title">
                <el-text truncated>
                  【算法系列篇】二分查找——这还是你所知道的二分查找算法吗？
                </el-text>
              </div>
              <div class="describe">
                <label>
                  JavaScript【浏览器环境概述(BOM)、回流和重绘、 定时器之 setTimeout()、定时器之 setInterval()、 定时器实操、防抖(debounce)】(十六)
                  定时器实操、防抖(debounce)】(十六)
                  定时器实操、防抖(debounce)】(十六)
                  定时器实操、防抖(debounce)】(十六)
                  定时器实操、防抖(debounce)】(十六)
                  定时器实操、防抖(debounce)】(十六)
                  定时器实操、防抖(debounce)】(十六)
                </label>
              </div>

              <div class="bottom">
                <div class="left">
                  <el-button size="small" type="primary">Java</el-button>
                </div>
                <div class="right">
                  发布时间：2023年8月24日22:56:00
                </div>
              </div>
            </el-col>
          </el-row>
        </el-card>

        <!--分页-->
        <div class="pagination">
          <el-pagination
              :current-page="pageNo"
              :page-size="pageSize"
              :page-sizes="[10, 20, 50, 100]"
              layout="total, sizes, prev, pager, next, jumper"
              :total="queryData.total"
              @size-change="handleSizeChange"
              @current-change="handleCurrentChange"
          />
        </div>
      </div>
      <div class="right">
        <el-card shadow="never">
          <!--一些基本信息-->
          <div class="base-info">
            <!--头像-->
            <div class="avatar">
              <el-popover
                  placement="top-start"
                  :width="200"
                  content="大家好，我是奇小，江湖id奇小，大家好，我是奇小，江湖id奇小，大家好，我是奇小，江湖id奇小"
              >
                <template #reference>
                  <el-avatar src="https://cube.elemecdn.com/0/88/03b0d39583f48206768a7534e55bcpng.png"/>
                </template>
              </el-popover>
            </div>

            <div class="name">
              <el-link :underline="false" href="https://gitee.com/qq651901286" target="_blank">
                奇小
              </el-link>
            </div>
          </div>

          <!--联系方式-->
          <div class="contact">
            <svg t="1692785322129" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="4880" width="32" height="32"><path d="M664.250054 368.541681c10.015098 0 19.892049 0.732687 29.67281 1.795902-26.647917-122.810047-159.358451-214.077703-310.826188-214.077703-169.353083 0-308.085774 114.232694-308.085774 259.274068 0 83.708494 46.165436 152.460344 123.281791 205.78483l-30.80868 91.730191 107.688651-53.455469c38.558178 7.53665 69.459978 15.308661 107.924012 15.308661 9.66308 0 19.230993-0.470721 28.752858-1.225921-6.025227-20.36584-9.521864-41.723264-9.521864-63.862493C402.328693 476.632491 517.908058 368.541681 664.250054 368.541681zM498.62897 285.87389c23.200398 0 38.557154 15.120372 38.557154 38.061874 0 22.846334-15.356756 38.156018-38.557154 38.156018-23.107277 0-46.260603-15.309684-46.260603-38.156018C452.368366 300.994262 475.522716 285.87389 498.62897 285.87389zM283.016307 362.090758c-23.107277 0-46.402843-15.309684-46.402843-38.156018 0-22.941502 23.295566-38.061874 46.402843-38.061874 23.081695 0 38.46301 15.120372 38.46301 38.061874C321.479317 346.782098 306.098002 362.090758 283.016307 362.090758zM945.448458 606.151333c0-121.888048-123.258255-221.236753-261.683954-221.236753-146.57838 0-262.015505 99.348706-262.015505 221.236753 0 122.06508 115.437126 221.200938 262.015505 221.200938 30.66644 0 61.617359-7.609305 92.423993-15.262612l84.513836 45.786813-23.178909-76.17082C899.379213 735.776599 945.448458 674.90216 945.448458 606.151333zM598.803483 567.994292c-15.332197 0-30.807656-15.096836-30.807656-30.501688 0-15.190981 15.47546-30.477129 30.807656-30.477129 23.295566 0 38.558178 15.286148 38.558178 30.477129C637.361661 552.897456 622.099049 567.994292 598.803483 567.994292zM768.25071 567.994292c-15.213493 0-30.594809-15.096836-30.594809-30.501688 0-15.190981 15.381315-30.477129 30.594809-30.477129 23.107277 0 38.558178 15.286148 38.558178 30.477129C806.808888 552.897456 791.357987 567.994292 768.25071 567.994292z" p-id="4881"></path></svg>
            <svg t="1692785252850" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="3672" width="32" height="32"><path d="M824.8 613.2c-16-51.4-34.4-94.6-62.7-165.3C766.5 262.2 689.3 112 511.5 112 331.7 112 256.2 265.2 261 447.9c-28.4 70.8-46.7 113.7-62.7 165.3-34 109.5-23 154.8-14.6 155.8 18 2.2 70.1-82.4 70.1-82.4 0 49 25.2 112.9 79.8 159-26.4 8.1-85.7 29.9-71.6 53.8 11.4 19.3 196.2 12.3 249.5 6.3 53.3 6 238.1 13 249.5-6.3 14.1-23.8-45.3-45.7-71.6-53.8 54.6-46.2 79.8-110.1 79.8-159 0 0 52.1 84.6 70.1 82.4 8.5-1.1 19.5-46.4-14.5-155.8z" p-id="3673"></path></svg>
            <svg t="1692785809014" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="10590" width="32" height="32"><path d="M937.4 423.9c-84 0-165.7-27.3-232.9-77.8v352.3c0 179.9-138.6 325.6-309.6 325.6S85.3 878.3 85.3 698.4c0-179.9 138.6-325.6 309.6-325.6 17.1 0 33.7 1.5 49.9 4.3v186.6c-15.5-6.1-32-9.2-48.6-9.2-76.3 0-138.2 65-138.2 145.3 0 80.2 61.9 145.3 138.2 145.3 76.2 0 138.1-65.1 138.1-145.3V0H707c0 134.5 103.7 243.5 231.6 243.5v180.3l-1.2 0.1" p-id="10591"></path></svg>
            <svg t="1692785136470" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="2698" width="32" height="32"><path d="M512 1024C230.4 1024 0 793.6 0 512S230.4 0 512 0s512 230.4 512 512-230.4 512-512 512z m259.2-569.6H480c-12.8 0-25.6 12.8-25.6 25.6v64c0 12.8 12.8 25.6 25.6 25.6h176c12.8 0 25.6 12.8 25.6 25.6v12.8c0 41.6-35.2 76.8-76.8 76.8h-240c-12.8 0-25.6-12.8-25.6-25.6V416c0-41.6 35.2-76.8 76.8-76.8h355.2c12.8 0 25.6-12.8 25.6-25.6v-64c0-12.8-12.8-25.6-25.6-25.6H416c-105.6 0-188.8 86.4-188.8 188.8V768c0 12.8 12.8 25.6 25.6 25.6h374.4c92.8 0 169.6-76.8 169.6-169.6v-144c0-12.8-12.8-25.6-25.6-25.6z"  p-id="2699"></path></svg>
            <svg t="1692785597660" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="9284" width="32" height="32"><path d="M128 853.333333h768a42.666667 42.666667 0 0 1 0 85.333334H128a42.666667 42.666667 0 0 1 0-85.333334zM256 85.333333h512a170.666667 170.666667 0 0 1 170.666667 170.666667v341.333333a170.666667 170.666667 0 0 1-170.666667 170.666667H256a170.666667 170.666667 0 0 1-170.666667-170.666667V256a170.666667 170.666667 0 0 1 170.666667-170.666667z m0 85.333334a85.333333 85.333333 0 0 0-85.333333 85.333333v341.333333a85.333333 85.333333 0 0 0 85.333333 85.333334h512a85.333333 85.333333 0 0 0 85.333333-85.333334V256a85.333333 85.333333 0 0 0-85.333333-85.333333H256z m42.666667 85.333333a42.666667 42.666667 0 0 1 42.666666 42.666667v256a42.666667 42.666667 0 0 1-85.333333 0V298.666667a42.666667 42.666667 0 0 1 42.666667-42.666667z m213.333333 170.666667a42.666667 42.666667 0 0 1 42.666667 42.666666v85.333334a42.666667 42.666667 0 0 1-85.333334 0v-85.333334a42.666667 42.666667 0 0 1 42.666667-42.666666z m213.333333-85.333334a42.666667 42.666667 0 0 1 42.666667 42.666667v170.666667a42.666667 42.666667 0 0 1-85.333333 0V384a42.666667 42.666667 0 0 1 42.666666-42.666667z" p-id="9285"></path></svg>
            <svg t="1692785371796" class="icon" viewBox="0 0 1024 1024" version="1.1" xmlns="http://www.w3.org/2000/svg" p-id="5940" width="32" height="32"><path d="M838.954667 234.666667H170.666667c-3.626667 0-7.168 0.448-10.56 1.322666l323.690666 323.669334a21.333333 21.333333 0 0 0 30.165334 0L838.954667 234.666667z m46.144 14.186666l-260.693334 260.693334 262.933334 262.912c5.44-7.168 8.661333-16.106667 8.661333-25.792V277.333333c0-10.944-4.117333-20.906667-10.88-28.48zM843.861333 789.333333l-249.6-249.621333-50.133333 50.133333a64 64 0 0 1-90.517333 0l-50.112-50.133333L156.373333 786.88c4.48 1.578667 9.28 2.453333 14.314667 2.453333h673.194667zM128.661333 754.218667L373.333333 509.525333 129.578667 265.813333A42.709333 42.709333 0 0 0 128 277.333333v469.333334c0 2.56 0.213333 5.098667 0.661333 7.552zM170.666667 192h682.666666a85.333333 85.333333 0 0 1 85.333334 85.333333v469.333334a85.333333 85.333333 0 0 1-85.333334 85.333333H170.666667a85.333333 85.333333 0 0 1-85.333334-85.333333V277.333333a85.333333 85.333333 0 0 1 85.333334-85.333333z" p-id="5941"></path></svg>
          </div>

        </el-card>
      </div>
    </div>
  </div>
</template>

<script setup lang="ts">
const queryData = ref({
  pageNo: 1,
  pageSize: 10,
  total: 2023,
});
const pageNo = ref(2);
const pageSize = ref(10)

const handleSizeChange = (val: number) => {
  console.log(queryData.value)
}
const handleCurrentChange = (val: number) => {
  console.log(queryData.value)
}
</script>

<style scoped lang="scss">
.container {
  .content {
    width: 1200px;
    display: flex;
    justify-content: space-between;
    .left {
      width: 790px;
      .el-card {
        margin-bottom: 20px;
        .el-row {
          .el-col{
            height: 120px;
            .cover {
              width: 100%;
              height: 100%;
            }
            .title {
              .el-text {
                font-size: 20px;
                padding-left: 10px;
                color: black;
              }
              .el-text:hover {
                color: #409eff;
                cursor:pointer;
              }
            }
            .describe {
              label {
                margin-top: 10px;
                padding-left: 10px;
                overflow: hidden;
                -webkit-line-clamp: 3;
                text-overflow: ellipsis;
                display: -webkit-box;
                -webkit-box-orient: vertical;
              }
            }
            .bottom {
              display: flex;
              align-items: center;
              justify-content: space-between;
              margin-top: 10px;
              .left {
                width: 50%;
                .el-button {
                  margin-left: 10px;
                }
              }
              .right {
                width: 50%;
              }
            }
          }
        }
      }
      .pagination {
        width: 100%;
        display: flex;
        justify-content: center;
      }
    }
    .right {
      width: 390px;
      .el-card {
        .base-info {
          display: flex;
          justify-content: center;
          .avatar {
            .el-avatar {
              width: 60px;
              height: 60px;
            }
          }
          .name {
            margin-left: 20px;
            display: flex;
            justify-content: center;
            .el-link {
              font-size: 20px;
            }
          }
        }

        .contact {
          margin-top: 20px;
          display: flex;
          justify-content: space-between;
          svg:hover {
            fill: #409eff;
          }
        }
      }
    }
  }
}
</style>
